Revit 2026 API

# ThermalAssetSpecificHeat Property

---

The specific heat of the asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double SpecificHeat { get; set; }
```
```vb
Public Property SpecificHeat As Double
	Get
	Set
```
```cpp
public:
property double SpecificHeat {
	double get ();
	void set (double value);
}
```
```fsharp
member SpecificHeat : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for specificHeat must be non-negative. |

Values are in squared-feet per Kelvin, squared-second (ft²/(K · s²)) and must be non-negative.

#### Reference

ThermalAsset Class

Autodesk.Revit.DB Namespace